#!/usr/bin/python
# -*- coding: utf-8 -*-
# 這個程式主要是為了解決心之旅R18的玩家，會卡教學的問題。
# code 參考網址: https://blog.gtwang.org/programming/python-mysqldb-connect-mysql-database-tutorial/
# 需要安裝 MySQLdb
# 在 centos 使用 「sudo yum install MySQL-python」來安裝 MySQLdb
# 引入 MySQLdb 模組，提供連接 MySQL 的功能

import MySQLdb

ids = [50, 179, 294, 307, 427, 504, 531, 576, 718, 787, 1149, 1425, 1427, 1601, 1766, 1840, 1939, 1981, 2069, 2115, 3068, 3245, 3312, 3491, 3590, 3696, 4034, 4300, 4408, 4567, 4595, 5011, 5205, 5407, 5503, 6004, 6137, 6251, 6431, 6498, 6646, 6699, 6826, 6965, 7009, 7023, 7036, 7051, 7086, 7116, 7177, 7385, 7497, 7604, 7640, 7960, 8651, 9032, 9092, 9404, 9527, 10129, 10646, 10973, 11292, 11385, 11434, 12410, 12775, 13192, 13411, 13485, 13630, 13777, 13892, 13907, 14306, 14333, 14375, 14420, 14456, 14867, 15290, 15561, 15716, 15941, 16088, 16167, 17054, 17842, 17923, 18763, 18935, 18993, 18997, 19163, 19497, 19517, 19529, 19556, 19575, 19752, 19759, 19779, 19925, 19980, 20056, 20152, 20274, 20434, 20586, 20770, 20810, 21185, 21453, 21486, 21874, 22577, 22743, 23664, 24969, 24972, 25105, 25519, 25765, 26126, 26758, 27027, 27588, 27991, 28172, 28558, 28676, 29119, 29214, 29633, 30112, 30924, 31765, 32515, 32552, 32595, 33715, 34191, 34790, 35447, 41627, 43826, 45965, 47223, 48713, 49750, 50977, 51570]

_result_text = ''

print("玩家名單: %s" % ids)

for id in ids:

  print("目前玩家ID: %s" % id)
  print("開始連線資料庫...")
  # 連接 MySQL 資料庫
  db = MySQLdb.connect(host="127.0.0.1", user="jim", passwd="5k5%F6G_", db="r18_server", port=3307)
  cur = db.cursor()
  print("執行 update_player_teaching_info")
  # 執行 MySQL 查詢指令
  cur.callproc('update_player_teaching_info', [id, _result_text])
  cur.fetchall()
  db.commit()
  print("資料庫連線結束")
  db.close()
